# St7SetNFAFileOpenMinMass

Sets the mass participation threshold for result cases of Natural Frequency results.

long St7SetNFAFileOpenMinMass(long uID, double Mass)
Input Parameters
uID
Strand7 model file ID.
Mass
Minimum mass participation (percentage between 0.0 and 50.0) for a result case to be available when
natural frequency results are opened.